Конфигурация отчетов/Catalogs/СписокЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>СписокЗадач</Name>
			<Comment>Хранение задач созданых пользователем</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Ответственый</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Отделы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инициатор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Отделы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусВыполнения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусВыполнения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Запланировано</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Объекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЗадачи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Задачи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Коментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрогрессБар</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЗаписи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыЗаписей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокЗадач</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Задача</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СписокЗадач</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Исполнитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Отделы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокВыполнения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Запланировано</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусВыполнения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтатусВыполнения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипЗадачи</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Задачи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидЗаписи</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыЗаписей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Конфигурация отчетов/InformationRegisters/АтрибутыЗадачи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>АтрибутыЗадачи</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:Type>cfg:CatalogRef.Объекты</v8:Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:EnumRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники_Отделы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СписокЗадач</v8:Type>
						<v8:Type>cfg:TaskRef.Задачи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Атрибут</Name>
					<Type>
						<v8:Type>cfg:EnumRef.АтрибутыЗадачи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация отчетов/InformationRegisters/РодительЗадачи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>РодительЗадачи</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Родитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СписокЗадач</v8:Type>
						<v8:Type>cfg:TaskRef.Задачи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники_Отделы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СписокЗадач</v8:Type>
						<v8:Type>cfg:TaskRef.Задачи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация отчетов/Enums/АтрибутыЗадачи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>АтрибутыЗадачи</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Ответственный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Инициатор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтатусВыполнения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Объект</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТипЗадачи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Коментарий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДатаСозданияЗадачи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Запланировано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СрокВыполнения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДобавитьМетку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьМетку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДобавитьОборудование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьОборудование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Напоминание</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация отчетов/Enums/СтатусВыполнения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусВыполнения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Создано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполняется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВОжидании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтправленаИсполнителю</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отложенно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Удалена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация отчетов/Enums/ВидыЗаписей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыЗаписей</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Задача</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Напоминание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Информация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Запись</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация отчетов/Documents/ПланРабот.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ПланРабот</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СсылкаНаЗаказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеЗадачи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Отделы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусВыполнения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусВыполнения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПланаРабот</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипПланаРабот</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокВыполнении</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланРаботРодитель</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПланРабот</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Объекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФункциональныйТип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ФункциональныйТипПлана</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Задачи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрогресБар</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоментарийКЗадаче</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Этапы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗадачаСсылка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Задачи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Задача</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ответственный</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Отделы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Исполнитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Отделы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокВыполнения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусВыполнения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтатусВыполнения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентВыполнения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СсылкаНаПланРабот</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ПланРабот</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидПроцентВыполнения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>5</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПрогресБарВыполнения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФлагОбработано</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Открыть</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация отчетов/Catalogs/СписокЗадач/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область УправлениеФормой

&НаКлиенте
Процедура ОбновитьФорму()
	//проверка наличия задач
	КоличествоЗадач = Объект.СписокЗадач.Количество();
	Если КоличествоЗадач>0 Тогда 
		НаличиеВложенныхЗадач = Истина;
	Иначе 
		НаличиеВложенныхЗадач = Ложь;
	КонецЕсли;
	
	//Изминение доступности панели управления
	ДоступностьПанелиУправления(НаличиеВложенныхЗадач);

КонецПроцедуры // ОбновитьФорму()


&НаКлиенте
Процедура ДоступностьПанелиУправления(Доступность)
	
	Элементы.ОтправитьВРаботу.Доступность = Доступность;
	Элементы.ОткрытьПроект.Доступность = Доступность;
	Элементы.ОткрытьДиалог.Доступность = Доступность;
	Элементы.ЗапланироватьЗадачу.Доступность = Доступность;
	Элементы.ЗавершитьЗадачу.Доступность = Доступность;

КонецПроцедуры

#КонецОбласти

#Область ТехническиеПроцедурыИФункции

Функция СовпаденияЗначенияАтрибута(Реквезит, Атрибут, Ссылка) //сравнивает новое значение и текущее. в случае совпадения возвращает истину
	ТекущееЗначение = РегистрыСведений.АтрибутыЗадачи.ТекущееЗначениеАтрибутаЗадачи(Ссылка, Атрибут);
	Если ТекущееЗначение = Реквезит Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
КонецФункции

Функция ПроверкаНаСоздаениеИзминений(Реквизит) //проверяет на запись объекта и заполенения реквезита 
	Если Объект.Ссылка = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Реквизит) = Ложь Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Процедура ПроверкаИЗаписьАтрибута(Реквизит, Атрибут)
	Если ПроверкаНаСоздаениеИзминений(Реквизит) = Ложь Тогда
		Возврат;
	КонецЕсли;

	Если СовпаденияЗначенияАтрибута(Реквизит, Атрибут, Объект.Ссылка) = Истина Тогда
		Возврат;	
	КонецЕсли;


	НовыеЗаписиВ_Регистры.ЗаписьАтрибута_В_Регистр(Объект.Ссылка, Атрибут, 
			Реквизит, ПодготовкаДанных.ПолучитьТекущегоПользователя()); 
	Записать();	
	
КонецПроцедуры

&НаСервере
Процедура ПроверкаИЗаписьАтрибутаВТЧ(Атрибут)
	ТекСтроки = Элементы.СписокЗадач.ТекущаяСтрока;
	ЗначенияСтроки = Объект.СписокЗадач.НайтиПоИдентификатору(ТекСтроки);
	
	Если Атрибут = Перечисления.АтрибутыЗадачи.Ответственный Тогда
		НовоеЗначение = ЗначенияСтроки.Исполнитель;	
	ИначеЕсли Атрибут = Перечисления.АтрибутыЗадачи.СрокВыполнения Тогда
		НовоеЗначение = ЗначенияСтроки.СрокВыполнения;	
	ИначеЕсли Атрибут = Перечисления.АтрибутыЗадачи.Запланировано Тогда
		НовоеЗначение = ЗначенияСтроки.Запланировано;	
	ИначеЕсли Атрибут = Перечисления.АтрибутыЗадачи.СтатусВыполнения Тогда
		НовоеЗначение = ЗначенияСтроки.СтатусВыполнения;	
	ИначеЕсли Атрибут = Перечисления.АтрибутыЗадачи.ТипЗадачи Тогда
		НовоеЗначение = ЗначенияСтроки.ТипЗадачи;	
	КонецЕсли;
	
	Если СовпаденияЗначенияАтрибута(НовоеЗначение, Атрибут, ЗначенияСтроки.Задача) = Истина Тогда
		Возврат;	
	КонецЕсли;         //задача нашлась

	Если НовоеЗначение = Перечисления.СтатусВыполнения.Завершено Тогда
		Документы.ПланРабот.ЗавершитьЗадачу(ЗначенияСтроки.Задача);     //завершешние всех вложеных задач
	Иначе
		НовыеЗаписиВ_Регистры.ЗаписьАтрибута_В_Регистр(ЗначенияСтроки.Задача, Атрибут, 
			НовоеЗначение, ПодготовкаДанных.ПолучитьТекущегоПользователя()); 
	КонецЕсли;
	
	Записать();	
	
КонецПроцедуры


Процедура ОбновитьПодчиненныеЗадачи()
	
	Объект.СписокЗадач.Очистить();
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РодительЗадачиСрезПоследних.Задача КАК Задача,
		|	РодительЗадачиСрезПоследних.Родитель КАК Родитель
		|ИЗ
		|	РегистрСведений.РодительЗадачи.СрезПоследних(, ) КАК РодительЗадачиСрезПоследних
		|ГДЕ
		|	РодительЗадачиСрезПоследних.Родитель = &Родитель";
	
	Запрос.УстановитьПараметр("Родитель", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если РегистрыСведений.АтрибутыЗадачи.ТекущееЗначениеАтрибутаЗадачи(Выборка.Задача, Перечисления.АтрибутыЗадачи.СтатусВыполнения) = Перечисления.СтатусВыполнения.Удалена Тогда
			Продолжить;
		КонецЕсли;
		
		ЗначенияСтроки = Объект.СписокЗадач.Добавить();
		ЗначенияСтроки.Задача = Выборка.Задача;
		ЗначенияСтроки.Исполнитель = РегистрыСведений.АтрибутыЗадачи.ТекущееЗначениеАтрибутаЗадачи(Выборка.Задача, Перечисления.АтрибутыЗадачи.Ответственный);
		ЗначенияСтроки.СрокВыполнения = РегистрыСведений.АтрибутыЗадачи.ТекущееЗначениеАтрибутаЗадачи(Выборка.Задача, Перечисления.АтрибутыЗадачи.СрокВыполнения);
		ЗначенияСтроки.Запланировано = РегистрыСведений.АтрибутыЗадачи.ТекущееЗначениеАтрибутаЗадачи(Выборка.Задача, Перечисления.АтрибутыЗадачи.Запланировано);
		ЗначенияСтроки.СтатусВыполнения = РегистрыСведений.АтрибутыЗадачи.ТекущееЗначениеАтрибутаЗадачи(Выборка.Задача, Перечисления.АтрибутыЗадачи.СтатусВыполнения);
		ЗначенияСтроки.Коментарий = РегистрыСведений.АтрибутыЗадачи.ТекущееЗначениеАтрибутаЗадачи(Выборка.Задача, Перечисления.АтрибутыЗадачи.Коментарий);
		ЗначенияСтроки.ТипЗадачи = РегистрыСведений.АтрибутыЗадачи.ТекущееЗначениеАтрибутаЗадачи(Выборка.Задача, Перечисления.АтрибутыЗадачи.ТипЗадачи);
	    ЗначенияСтроки.ВидЗаписи = РегистрыСведений.АтрибутыЗадачи.АктуальныйВидЗаписи(Выборка.Задача);

	КонецЦикла;
	
	Записать();
	
КонецПроцедуры


Процедура ОбновитьПрогрессБар()
	
	Объект.ПрогрессБар = РегистрыСведений.АтрибутыЗадачи.СформироватьСтрокуПрогрессБара(Объект.Ссылка, 2);
	
КонецПроцедуры

&НаСервере
Функция ДанныеВыделенойСтроки()
	
	ТекСтрока = Элементы.СписокЗадач.ТекущаяСтрока;
	ЗначенияСтроки = Объект.СписокЗадач.НайтиПоИдентификатору(ТекСтрока);	
	
	Возврат ЗначенияСтроки; 
	
КонецФункции

&НаСервере
Процедура ПроверкаИОбновлениеВидаЗадачи()

	АктуальныйВидЗадачи = РегистрыСведений.АтрибутыЗадачи.АктуальныйВидЗаписи(Объект.Ссылка);
	
	Если АктуальныйВидЗадачи <> Объект.ВидЗаписи Тогда
		НовыеЗаписиВ_Регистры.ЗаписьВидаЗадачи_В_Регистр(Объект.Ссылка, Объект.ВидЗаписи, ПодготовкаДанных.ПолучитьТекущегоПользователя());
	КонецЕсли;

КонецПроцедуры // ПроверкаВидаЗадачи()


#КонецОбласти

#Область ВзаимодействиеРеквизитыИ_ТЧ

//*************************************РЕКВИЗИТЫ*****************************************************
&НаСервере
Функция СоответствиеРеквизиты(ПолучитьЗначения)
	
	Реквезиты = Новый Соответствие;
	Если ПолучитьЗначения = Истина Тогда
		Реквезиты.Вставить("Ответственый", Объект.Ответственый);
		Реквезиты.Вставить("Инициатор", Объект.Инициатор);
		Реквезиты.Вставить("СтатусВыполнения", Объект.СтатусВыполнения);
		Реквезиты.Вставить("СрокВыполнения", Объект.СрокВыполнения);
		Реквезиты.Вставить("Запланировано", Объект.Запланировано);
		Реквезиты.Вставить("Объект", Объект.Объект);
		Реквезиты.Вставить("ТипЗадачи", Объект.ТипЗадачи);
		Реквезиты.Вставить("Коментарий", Объект.Коментарий);
	Иначе
		Реквезиты.Вставить("Ответственый", Перечисления.АтрибутыЗадачи.Ответственный);
		Реквезиты.Вставить("Инициатор", Перечисления.АтрибутыЗадачи.Ответственный);
		Реквезиты.Вставить("СтатусВыполнения", Перечисления.АтрибутыЗадачи.Ответственный);
		Реквезиты.Вставить("СрокВыполнения", Перечисления.АтрибутыЗадачи.Ответственный);
		Реквезиты.Вставить("Запланировано", Перечисления.АтрибутыЗадачи.Ответственный);
		Реквезиты.Вставить("Объект", Перечисления.АтрибутыЗадачи.Ответственный);
		Реквезиты.Вставить("ТипЗадачи", Перечисления.АтрибутыЗадачи.Ответственный);
		Реквезиты.Вставить("Коментарий", Перечисления.АтрибутыЗадачи.Ответственный);
	КонецЕсли;

	
	Возврат Реквезиты;
	
КонецФункции // СоответствиеРеквезиты()

&НаСервере
Процедура Реквизиты_ПриИзминенииНаСервере(НазваниеРеквизита)

	СписокРеквизитов = СоответствиеРеквизиты(Ложь);
	Атрибут = СписокРеквизитов.Получить(НазваниеРеквизита);
	
	СписокРеквизитов = СоответствиеРеквизиты(Истина);
	Значение = СписокРеквизитов.Получить(НазваниеРеквизита);

	ПроверкаИЗаписьАтрибута(Значение, Атрибут);

КонецПроцедуры


&НаКлиенте
Процедура Реквизиты_ПриИзминении(Элемент)

	Реквизиты_ПриИзминенииНаСервере(Элемент.Имя);		

КонецПроцедуры // РеквизитыПриИзминении()

//************************************ТЧ*****************************************************

&НаСервере
Функция КолонкиВСтруктуру()
	
	Колонки = Новый Соответствие;
	Колонки.Вставить("СписокЗадачИсполнитель", Перечисления.АтрибутыЗадачи.Ответственный); 
	Колонки.Вставить("СписокЗадачСрокВыполнения", Перечисления.АтрибутыЗадачи.СрокВыполнения);
	Колонки.Вставить("СписокЗадачЗапланировано", Перечисления.АтрибутыЗадачи.Запланировано);
	Колонки.Вставить("СписокЗадачСтатусВыполнения", Перечисления.АтрибутыЗадачи.СтатусВыполнения);
	Колонки.Вставить("СписокЗадачКоментарий", Перечисления.АтрибутыЗадачи.Коментарий);
	Колонки.Вставить("СписокЗадачТипЗадачи", Перечисления.АтрибутыЗадачи.ТипЗадачи);

	Колонки.Вставить("СписокЗадачВидЗаписи", Ложь);

	Возврат Колонки;

КонецФункции


&НаСервере
Процедура СписокЗадач_Колонки_ПриИзминении(Колонка)

	СоответствиеТЧ = КолонкиВСтруктуру();
	ТекущийАтрибут = СоответствиеТЧ.Получить(Колонка);
	
	Если ТекущийАтрибут = Ложь Тогда
		//проверить и обновить вид задачи	
		//надо получить ссылку на задачу
		Данные = ДанныеВыделенойСтроки();
		Задача = Данные.Задача;
		ВидЗаписи = Данные.ВидЗаписи;
		РегистрыСведений.АтрибутыЗадачи.ПроверитьИОбновить_ВидЗаписи(Задача, ВидЗаписи);
		
	Иначе
		ПроверкаИЗаписьАтрибутаВТЧ(ТекущийАтрибут);
	КонецЕсли;


КонецПроцедуры // СписокЗадач_Колонки_ПриИзминении()


&НаКлиенте
Процедура ТЧ_ПриИзминении(Элемент)
	СписокЗадач_Колонки_ПриИзминении(Элемент.Имя);
КонецПроцедуры


#КонецОбласти

#Область ВзаимодействиеСИнтерфейсом


&НаСервере
Процедура СтатусВыполненияПриИзмененииНаСервере()
	
	Реквизит = Объект.СтатусВыполнения; 
	Атрибут = Перечисления.АтрибутыЗадачи.СтатусВыполнения;
	Если Атрибут = Перечисления.СтатусВыполнения.Завершено Тогда
		Документы.ПланРабот.ЗавершитьЗадачу(Объект.Ссылка);
	Иначе
		ПроверкаИЗаписьАтрибута(Реквизит, Атрибут);
	КонецЕсли;
	
КонецПроцедуры



Процедура ОбновлениеРеквезитов(Реквизит, Атрибут)
	
	ТекущееЗначение = РегистрыСведений.АтрибутыЗадачи.ТекущееЗначениеАтрибутаЗадачи(Объект.Ссылка, Атрибут); 	
	Если ТекущееЗначение = Реквизит Тогда
		Возврат;	
	КонецЕсли;
	
	Реквизит = ТекущееЗначение;
	Записать();
	
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ОбновлениеРеквезитов(Объект.Ответственый, Перечисления.АтрибутыЗадачи.Ответственный);
		ОбновлениеРеквезитов(Объект.Инициатор, Перечисления.АтрибутыЗадачи.Инициатор);
		ОбновлениеРеквезитов(Объект.СтатусВыполнения, Перечисления.АтрибутыЗадачи.СтатусВыполнения);
		ОбновлениеРеквезитов(Объект.СрокВыполнения, Перечисления.АтрибутыЗадачи.СрокВыполнения);
		ОбновлениеРеквезитов(Объект.Запланировано, Перечисления.АтрибутыЗадачи.Запланировано);
		ОбновлениеРеквезитов(Объект.Объект, Перечисления.АтрибутыЗадачи.Объект);
		ОбновлениеРеквезитов(Объект.ТипЗадачи, Перечисления.АтрибутыЗадачи.ТипЗадачи);
	КонецЕсли;
	
	ОбновитьПодчиненныеЗадачи();
	ОбновитьПрогрессБар();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПараметрДинамическогоСписка()
    // Имя элемента динамического списка на форме, например, "Список"
	ПодЗадачи.Параметры.УстановитьЗначениеПараметра("Родитель", Объект.Ссылка);
	//Список.Параметры.УстановитьЗначениеПараметра("ТекущийТовар", Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
	ОбновитьФорму();
	УстановитьПараметрДинамическогоСписка();
КонецПроцедуры

&НаСервере
Процедура ПриЗакрытииНаСервере()
	//проверить записана задача
	Если ЗначениеЗаполнено(Объект.Ссылка) = Ложь Тогда
		Возврат;	
	КонецЕсли;
	//проверить наличие записи о создании
	ДатаСоздания = РегистрыСведений.АтрибутыЗадачи.ТекущееЗначениеАтрибутаЗадачи(Объект.Ссылка, Перечисления.АтрибутыЗадачи.ДатаСозданияЗадачи);
	Если ДатаСоздания = Неопределено Тогда
		Документы.ЗаписьАтрибутаЗадачи.СоздатьЗаписьАтрибута(Объект.Ссылка, Перечисления.АтрибутыЗадачи.ДатаСозданияЗадачи, ТекущаяДата(), ПодготовкаДанных.ПолучитьТекущегоПользователя());
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	ПриЗакрытииНаСервере();
КонецПроцедуры

&НаСервере
Процедура НаименованиеПриИзмененииНаСервере()
	Записать();
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	НаименованиеПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура СписокЗадачЗадачаПриИзмененииНаСервере()
	
	ТекСтроки = Элементы.СписокЗадач.ТекущаяСтрока;
	ЗначенияСтроки = Объект.СписокЗадач.НайтиПоИдентификатору(ТекСтроки);
	
	Задача = ЗначенияСтроки.Задача; 
	//проверить связь задачи с родителем
	ТекущийРодитель = РегистрыСведений.АтрибутыЗадачи.ТекущийРодительЗадачи(Задача);
	
	Если ТекущийРодитель <> Объект.Ссылка Тогда
		НовыеЗаписиВ_Регистры.ЗаписатьРодителя(Задача, Объект.Ссылка);	
	КонецЕсли;
	//сравнить значения
	ЗначенияСтроки.Исполнитель = РегистрыСведений.АтрибутыЗадачи.ТекущееЗначениеАтрибутаЗадачи(Задача, Перечисления.АтрибутыЗадачи.Ответственный);
	ЗначенияСтроки.СрокВыполнения = РегистрыСведений.АтрибутыЗадачи.ТекущееЗначениеАтрибутаЗадачи(Задача, Перечисления.АтрибутыЗадачи.СрокВыполнения);
	ЗначенияСтроки.Запланировано = РегистрыСведений.АтрибутыЗадачи.ТекущееЗначениеАтрибутаЗадачи(Задача, Перечисления.АтрибутыЗадачи.Запланировано);
	ЗначенияСтроки.СтатусВыполнения = РегистрыСведений.АтрибутыЗадачи.ТекущееЗначениеАтрибутаЗадачи(Задача, Перечисления.АтрибутыЗадачи.СтатусВыполнения);
	ЗначенияСтроки.Коментарий = РегистрыСведений.АтрибутыЗадачи.ТекущееЗначениеАтрибутаЗадачи(Задача, Перечисления.АтрибутыЗадачи.Коментарий);
	ЗначенияСтроки.ТипЗадачи = РегистрыСведений.АтрибутыЗадачи.ТекущееЗначениеАтрибутаЗадачи(Задача, Перечисления.АтрибутыЗадачи.ТипЗадачи);

	Записать();
КонецПроцедуры


//*******************************ВЗАИМОДЕЙСТВИЕ С ЕЛЕМЕНТАМИ*****************************************
//***************************************************************************************************

//************************************************************************************
&НаСервере
Процедура ПроцентВыполненияНаСервере()
	Сообщить(Документы.ПланРабот.ПроцентВыполненияЗадачи(Объект.Ссылка));
КонецПроцедуры

&НаКлиенте
Процедура ПроцентВыполнения(Команда)
	ПроцентВыполненияНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура Обновить(Команда)
	ОбновитьФорму();
	ОбновитьПодчиненныеЗадачи();
	ОбновитьПрогрессБар();
КонецПроцедуры


#КонецОбласти

#Область ПанельУправленияЗадачами

&НаСервере
Функция СоответствиеКоманд()

	СписокКоманд = Новый Соответствие;
	СписокКоманд.Вставить("ОтправитьВРаботу", Истина);
	СписокКоманд.Вставить("ОткрытьПроект", Ложь);
	СписокКоманд.Вставить("Обновить", Истина);
	СписокКоманд.Вставить("ЗавершитьЗадачу", Ложь);
	СписокКоманд.Вставить("ОткрытьДиалог", Ложь);
	СписокКоманд.Вставить("ЗапланироватьЗадачу", Истина);
	СписокКоманд.Вставить("Завершить", Ложь);

	
	Возврат СписокКоманд;
	
КонецФункции // СоответствиеКоманд()
 

&НаСервере
Процедура ОбработатьКоманду_НаСервере(ИмяКоманды)
	
	Если ИмяКоманды = "ОтправитьВРаботу" Тогда
		// Отправить в работу означает назначить статус отправлено исполнителю.
		Данные = ДанныеВыделенойСтроки();
		
		АктуальныйСтатус = РегистрыСведений.АтрибутыЗадачи.ТекущееЗначениеАтрибутаЗадачи(Данные.Задача, Перечисления.АтрибутыЗадачи.СтатусВыполнения);
		Если АктуальныйСтатус <> Перечисления.СтатусВыполнения.Создано Тогда
			Возврат;	
		КонецЕсли;
		
		НовыеЗаписиВ_Регистры.ЗаписьАтрибута_В_Регистр(Данные.Задача, Перечисления.АтрибутыЗадачи.СтатусВыполнения, Перечисления.СтатусВыполнения.ОтправленаИсполнителю,
			ПодготовкаДанных.ПолучитьТекущегоПользователя());
			
		ОбновитьПодчиненныеЗадачи();
	ИначеЕсли ИмяКоманды = "ЗавершитьЗадачу" Тогда
		Данные = ДанныеВыделенойСтроки();
	
		АктуальныйСтатус = РегистрыСведений.АтрибутыЗадачи.ТекущееЗначениеАтрибутаЗадачи(Данные.Задача, Перечисления.АтрибутыЗадачи.СтатусВыполнения);
		Если АктуальныйСтатус = Перечисления.СтатусВыполнения.Завершено ИЛИ АктуальныйСтатус = Перечисления.СтатусВыполнения.Удалена Тогда
			Возврат;	
		КонецЕсли;                                                                                    
		
		Документы.ПланРабот.ЗавершитьЗадачу(Данные.Задача);
		
		ОбновитьПодчиненныеЗадачи();
	ИначеЕсли ИмяКоманды = "ЗапланироватьЗадачу" Тогда
			
		Данные = ДанныеВыделенойСтроки();
		ДатаПланирования = РегистрыСведений.АтрибутыЗадачи.ТекущееЗначениеАтрибутаЗадачи(Данные.Задача, Перечисления.АтрибутыЗадачи.Запланировано);
		Если ДатаПланирования = НачалоДня(ТекущаяДата()) Тогда
			Возврат;
		КонецЕсли;
		
		НовыеЗаписиВ_Регистры.ЗаписьАтрибута_В_Регистр(Данные.Задача, Перечисления.АтрибутыЗадачи.Запланировано, ТекущаяДата(), 
																	ПодготовкаДанных.ПолучитьТекущегоПользователя());
		СписокЗадачЗадачаПриИзмененииНаСервере();
	
	ИначеЕсли ИмяКоманды = "Завершить" Тогда
		Документы.ПланРабот.ЗавершитьЗадачу(Объект.Ссылка);
	КонецЕсли;
	

КонецПроцедуры // ОбработатьКоманду()


&НаКлиенте
Процедура ОбработатьКоманду_НаКлиента(ИмяКоманды)

	Если ИмяКоманды = "ОткрытьПроект" Тогда
		Если Элементы.СписокЗадач.ТекущаяСтрока = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		ТекСтрока = Элементы.СписокЗадач.ТекущаяСтрока;
		ЗначенияСтроки = Объект.СписокЗадач.НайтиПоИдентификатору(ТекСтрока); 
		Ссылка = ЗначенияСтроки.Задача;

		ПроцедурыФункции_НаКлиенте.ОткрытьФормуСПараметрами("Ключ", Ссылка, "Справочник.СписокЗадач.ФормаОбъекта");

	ИначеЕсли ИмяКоманды = "ОткрытьДиалог" Тогда
		
		ПроцедурыФункции_НаКлиенте.ОткрытьФормуСПараметрами("СсылкаНаЗадачу", Объект.Ссылка, "Обработка.ЧатЗадачи.Форма.Форма");

	ИначеЕсли ИмяКоманды = "Завершить" Тогда
		
		ОбработатьКоманду_НаСервере(ИмяКоманды);
		ОбновитьФорму();
		ОбновитьПодчиненныеЗадачи();
		ОбновитьПрогрессБар();
		
	ИначеЕсли ИмяКоманды = "ЗавершитьЗадачу" Тогда
	
		ОбработатьКоманду_НаСервере(ИмяКоманды);
		ОбновитьФорму();
		ОбновитьПодчиненныеЗадачи();
		ОбновитьПрогрессБар();
		
	КонецЕсли;

		
КонецПроцедуры // ОбработатьКоманду_НаКлиента()


&НаКлиенте
Процедура ОбщаяОбработкаКоманд(Команда)
	//ОбработатьКоманду(Команда.Имя);
	СписокКоманд =  СоответствиеКоманд();
	ОбработатьНаСервере = СписокКоманд.Получить(Команда.Имя);
	Если ОбработатьНаСервере = Истина Тогда  
		ОбработатьКоманду_НаСервере(Команда.Имя);
	Иначе
		//обработка на клиенте	
		ОбработатьКоманду_НаКлиента(Команда.Имя);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти



//***********************************************************
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Объект.Ссылка) = Ложь Или РегистрыСведений.АтрибутыЗадачи.АктуальныйВидЗаписи(Объект.Ссылка) = Неопределено Тогда
		Объект.ВидЗаписи = Перечисления.ВидыЗаписей.Задача;   
		Объект.СтатусВыполнения = Перечисления.СтатусВыполнения.Создано;
	КонецЕсли;
	
	Параметры.Родитель = Объект.Ссылка;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьАтрибутыНовойЗадачи()

	// вид задачи
	ПроверкаИОбновлениеВидаЗадачи();
	// статус задачи
	ПроверкаИЗаписьАтрибута(Объект.СтатусВыполнения, Перечисления.АтрибутыЗадачи.СрокВыполнения);
	// Дата создания
	ТекущееЗначение = РегистрыСведений.АтрибутыЗадачи.ТекущееЗначениеАтрибутаЗадачи(Объект.Ссылка, Перечисления.АтрибутыЗадачи.ДатаСозданияЗадачи);
	Если ТекущееЗначение = Неопределено Тогда
		НовыеЗаписиВ_Регистры.ЗаписьАтрибута_В_Регистр(Объект.Ссылка, Перечисления.АтрибутыЗадачи.ДатаСозданияЗадачи, 
			ТекущаяДата(), ПодготовкаДанных.ПолучитьТекущегоПользователя()); 
	КонецЕсли;

КонецПроцедуры // ЗаполнитьАтрибутыНовойЗадачи()


&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ЗаполнитьАтрибутыНовойЗадачи();
КонецПроцедуры

&НаКлиенте
Процедура ВидЗаписиПриИзменении(Элемент)
	ПроверкаИОбновлениеВидаЗадачи();	
КонецПроцедуры


&НаСервереБезКонтекста
Процедура ПодЗадачиПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	МассивЗадач = Новый Массив;
	Соответ = Новый Соответствие;
	МассивРегистра = Строки.ПолучитьКлючи();
	Для Каждого А Из МассивРегистра Цикл
		МассивЗадач.Добавить(А.Задача);	
		Соответ.Вставить(А.Задача, А);
	КонецЦикла;
	//перезапишим масси
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	АтрибутыЗадачиСрезПоследних.Задача КАК Задача,
		|	АтрибутыЗадачиСрезПоследних.Атрибут КАК Атрибут,
		|	АтрибутыЗадачиСрезПоследних.Значение КАК Значение
		|ИЗ
		|	РегистрСведений.АтрибутыЗадачи.СрезПоследних(, Задача В (&МассивЗадач)) КАК АтрибутыЗадачиСрезПоследних
		|ГДЕ
		|	АтрибутыЗадачиСрезПоследних.Атрибут = &Атрибут";
	
	Запрос.УстановитьПараметр("Атрибут", Перечисления.АтрибутыЗадачи.СтатусВыполнения);
	Запрос.УстановитьПараметр("МассивЗадач", МассивЗадач);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СтрокаСписка = Строки[Соответ.Получить(Выборка.Задача)];
		СтрокаСписка.Данные["Задача"] = Выборка.Задача; 
	КонецЦикла;

	
КонецПроцедуры


&НаСервере
Процедура ПодЗадачиПриИзмененииНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры


&НаСервере
Процедура ПодЗадачиВыборНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры


&НаКлиенте
Процедура ПодЗадачиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ПодЗадачиВыборНаСервере();
КонецПроцедуры
